# GetNumberOfRules Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingPreferenceManager..::..GetNumberOfRules Method
RoutingPreferenceManager Class See Also
---
The number of RoutingPreference rules in a group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int GetNumberOfRules(
	RoutingPreferenceRuleGroupType eGroupType
)
```

Visual Basic
---
```text
Public Function GetNumberOfRules ( _
	eGroupType As RoutingPreferenceRuleGroupType _
) As Integer
```

Visual C++
---
```text
public:
int GetNumberOfRules(
	RoutingPreferenceRuleGroupType eGroupType
)
```

# ### Parameters
eGroupType
    Type: Autodesk.Revit.DB..::..RoutingPreferenceRuleGroupType
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace